import os

# Лабиринт (0 = проход, 1 = стена, 'S' = старт, 'E' = выход)
maze = [
    ['#', '#', '#', '#', '#', '#', '#', '#', '#', '#'],
    ['#', 'S', '.', '.', '#', '.', '.', '.', '.', '#'],
    ['#', '#', '#', '.', '#', '.', '#', '#', '.', '#'],
    ['#', '.', '.', '.', '.', '.', '#', '.', '.', '#'],
    ['#', '.', '#', '#', '#', '#', '#', '.', '#', '#'],
    ['#', '.', '#', '.', '.', '.', '.', '.', '#', '#'],
    ['#', '.', '#', '.', '#', '#', '#', '#', '#', '#'],
    ['#', '.', '.', '.', '.', '.', '.', '.', 'E', '#'],
    ['#', '#', '#', '#', '#', '#', '#', '#', '#', '#']
]

# Найти стартовую позицию
def find_start(maze):
    for y, row in enumerate(maze):
        for x, cell in enumerate(row):
            if cell == 'S':
                return x, y
    return None

# Вывод лабиринта
def print_maze(maze):
    os.system('cls' if os.name == 'nt' else 'clear')  # Очистка экрана
    for row in maze:
        print(" ".join(row))
    print("\nУправление: W (вверх), A (влево), S (вниз), D (вправо). Q — выход.")

# Основная функция игры
def play_maze():
    px, py = find_start(maze)
    if not px:
        print("Ошибка: не найдена стартовая позиция!")
        return

    print("Добро пожаловать в Лабиринт!")
    print("Найди выход (E)!")

    while True:
        # Обновляем позицию игрока
        temp_maze = [row[:] for row in maze]  # Копия лабиринта
        temp_maze[py][px] = 'P'

        print_maze(temp_maze)

        move = input("Куда идём? (W/A/S/D): ").strip().upper()

        if move == 'Q':
            print("Выход из игры.")
            break

        new_px, new_py = px, py

        if move == 'W':
            new_py -= 1
        elif move == 'S':
            new_py += 1
        elif move == 'A':
            new_px -= 1
        elif move == 'D':
            new_px += 1
        else:
            print("Неверный ввод! Используй W, A, S, D.")
            continue

        # Проверка границ и стены
        if new_py < 0 or new_py >= len(maze) or new_px < 0 or new_px >= len(maze[0]):
            print("Выход за границы!")
            continue

        if maze[new_py][new_px] == '#':
            print("Стена! Нельзя пройти.")
            continue

        # Перемещение
        px, py = new_px, new_py

        # Проверка выхода
        if maze[py][px] == 'E':
            print_maze(temp_maze)
            print("🎉 Поздравляем! Вы нашли выход!")
            break

# Запуск игры
if __name__ == "__main__":
    play_maze()
